src/InformationRegisters/Scan_ЗначенияДанныхДляРасчетаУслугиПлатон/Scan_ЗначенияДанныхДляРасчетаУслугиПлатон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗначенияДанныхДляРасчетаУслугиПлатон</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоэффициентВзиманияПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифОплатыЗа1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОснованиеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействующийРазмерПлатыЗа1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЗначенияДанныхДляРасчетаУслугиПлатон/Forms/ФормаЗаписи/Module.bsl
//rarus tenkam 04.08.2017 mantis 10589 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Услуга) Тогда
		Запись.Услуга = Справочники.Scan_НоменклатураУслуг.УслугаПлатон;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры           

&НаКлиенте
Процедура КоэффициентВзиманияПлатыПриИзменении(Элемент)
	Запись.ДействующийРазмерПлатыЗа1Км = Запись.ТарифОплатыЗа1Км * Запись.КоэффициентВзиманияПлаты;
КонецПроцедуры

&НаКлиенте
Процедура ТарифОплатыЗа1КмПриИзменении(Элемент)
	Запись.ДействующийРазмерПлатыЗа1Км = Запись.ТарифОплатыЗа1Км * Запись.КоэффициентВзиманияПлаты;
КонецПроцедуры
//rarus tenkam 04.08.2017 mantis 10589 ---
